sim/detwave/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
	inlet
	{
	    type		uniformFixedValue;
	    uniformValue	table
		(
		 	(0 3000)
			(0.0001 3000)
			(0.0011 293)
		);
	}
	top 
	{
	    type            fixedValue;
	    value           uniform 293;
	}
	bottom
        {
            type            fixedValue;
            value           uniform 293;
        }
	outlet
	{
	    type            inletOutlet;
	    inletValue      uniform 293;
	    value           uniform 293;
	}
	frontAndBack
	{
	    type            empty;
	}
}


// ************************************************************************* //
