sim/detwave/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
	inlet
	{
	    type		uniformFixedValue;
	    uniformValue	table
		(
		     (0 2e6)
		     (0.0001 2e6)
		     (0.0011 101325)
		);
	}
	top
	{
	    type            zeroGradient;
	}
	bottom	
        {
            type            zeroGradient;
        }
	outlet
	{
            type           	waveTransmissive;
            value		uniform 101325;
            field		p;
            gamma		1.3; // guess
            phi			phi;
            rho			thermo:rho;
            psi			thermo:psi;
            lInf		0.05;
            fieldInf		101325;
        }
	frontAndBack
	{
	    type            empty;
	}
}


// ************************************************************************* //
