sim/detwave/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// NOTE THIS IS A WORK IN PROGRESS
defaultFieldValues
(
    volScalarFieldValue T 293 // [K]
    volScalarFieldValue p 101325 // [Pa]
);

regions
(
    boxToCell
    {
        box (0 0 -0.005) (0.01 0.005 0);
        fieldValues
        (
		volScalarFieldValue T 3000 // [K]
                volScalarFieldValue p 2e6 // [Pa]
        );
    }
);


// ************************************************************************* //
